-- converted from Envir/Market_Def/15Magic_SnakeVally-2.txt
-- fees from Envir/QuestDiary/MU_Total_Sell

local skillteacher = require('npc.include.skillteacher')

skillteacher.setTeacher
{
    greet = '时光飞逝啊，我也有像你一样年轻的时候。',
    redName = '跟你这种人我无话可说。',

    books =
    {
        ['战士'] =
        {
            {
                band = '1 - 10 等级 修炼魔法',
                list =
                {
                    {'基本剑术', 700},
                },
            },

            {
                band = '11 - 20 等级 修炼魔法',
                list =
                {
                    {'攻杀剑术', 1400},
                    {'刺杀剑术', 1900},
                },
            },

        },
        ['法师'] =
        {
            {
                band = '1 - 10 等级 修炼魔法',
                list =
                {
                    {'火球术', 700},
                    {'霹雳掌', 800},
                    {'冰月神掌', 900},
                    {'风掌', 1000},
                },
            },

            {
                band = '11 - 20 等级 修炼魔法',
                list =
                {
                    {'抗拒火环', 1200},
                    {'诱惑之光', 1300},
                    {'瞬息移动', 1400},
                    {'大火球', 1500},
                    {'雷电术', 1600},
                    {'冰月震天', 1700},
                    {'击风', 1800},
                    {'地狱火', 2000},
                },
            },

        },
        ['道士'] =
        {
            {
                band = '1 - 10 等级 修炼魔法',
                list =
                {
                    {'治愈术', 700},
                    {'精神力战法', 800},
                },
            },

            {
                band = '11 - 20 等级 修炼魔法',
                list =
                {
                    {'施毒术', 1200},
                    {'灵魂火符', 1300},
                    {'月魂断玉', 1400},
                    {'召唤骷髅', 1700},
                    {'隐身术', 2000},
                },
            },

        },
    },
}
