-- converted from Envir/Market_Def/15Magic_Bichon3-0.txt
-- fees from Envir/QuestDiary/MU_Total_Sell

local skillteacher = require('npc.include.skillteacher')

skillteacher.setTeacher
{
    greet = '（道士魔法）',
    redName = '跟你这种人我无话可说。',

    books =
    {
        ['道士'] =
        {
            {
                band = '1 - 10 等级 修炼魔法',
                list =
                {
                    {'治愈术', 700},
                    {'精神力战法', 800},
                },
            },

            {
                band = '11 - 20 等级 修炼魔法',
                list =
                {
                    {'施毒术', 1200},
                    {'灵魂火符', 1300},
                    {'月魂断玉', 1400},
                    {'召唤骷髅', 1700},
                    {'隐身术', 2000},
                },
            },

            {
                band = '21 - 30 等级 修炼魔法',
                list =
                {
                    {'幽灵盾', 2100},
                    {'集体隐身术', 2300},
                    {'月魂灵波', 2400},
                    {'神圣战甲术', 2500},
                    {'困魔咒', 2700},
                    {'空拳刀法', 2800},
                    {'强魔震法', 2900},
                    {'召唤神兽', 3000},
                },
            },

            {
                band = '31 - 40 等级 修炼魔法',
                list =
                {
                    {'群体治愈术', 3100},
                    {'超强召唤骷髅', 3300},
                    {'猛虎强势', 3400},
                    {'回生术', 3500},
                },
            },

            {
                band = '41 - 50 等级 修炼魔法',
                list =
                {
                    {'云寂术', 10000},
                    {'移花接玉', 10000},
                    {'妙影无踪', 10000},
                    {'阴阳法环', 10000},
                },
            },

        },
    },
}
