-- converted from Envir/Market_Def/15Magic_Samak3-5.txt
-- fees from Envir/QuestDiary/MU_Total_Sell

local skillteacher = require('npc.include.skillteacher')

skillteacher.setTeacher
{
    greet = '欢迎光临。我也是道馆弟子，不过和那些男修炼者一起修炼，我觉得很不方便，所以经常来到外地，帮助那些在修炼中遇到困难的人。如果你在修炼中有什么解决不了的问题，来找我就行了。你只需要支付适当的费用我就给你解释武功秘籍。',
    redName = '跟你这种人我无话可说。',

    books =
    {
        ['道士'] =
        {
            {
                band = '1 - 10 等级 修炼魔法',
                list =
                {
                    {'治愈术', 700},
                    {'精神力战法', 800},
                },
            },

            {
                band = '11 - 20 等级 修炼魔法',
                list =
                {
                    {'施毒术', 1200},
                    {'灵魂火符', 1300},
                    {'月魂断玉', 1400},
                    {'召唤骷髅', 1700},
                    {'隐身术', 2000},
                },
            },

            {
                band = '21 - 30 等级 修炼魔法',
                list =
                {
                    {'幽灵盾', 2100},
                    {'集体隐身术', 2300},
                    {'月魂灵波', 2400},
                    {'神圣战甲术', 2500},
                    {'困魔咒', 2700},
                    {'空拳刀法', 2800},
                    {'强魔震法', 2900},
                    {'召唤神兽', 3000},
                },
            },

            {
                band = '31 - 40 等级 修炼魔法',
                list =
                {
                    {'群体治愈术', 3100},
                    {'超强召唤骷髅', 3300},
                    {'猛虎强势', 3400},
                    {'回生术', 3500},
                },
            },

        },
    },
}
