-- converted from Envir/Market_Def/15Magic_Mongchon2-74.txt
-- fees from Envir/QuestDiary/MU_Total_Sell

local skillteacher = require('npc.include.skillteacher')

skillteacher.setTeacher
{
    greet = '好吧，比奇那儿没什么事吧？我是魔法研究会派来的雷翁坛主，到异乡修炼武功不容易吧。修炼的时候有什么不明白得就来问我吧，不过，不知道你知道不知道，派到异乡的坛主可不能免费传授武功。',
    redName = '跟你这种人我无话可说。',

    books =
    {
        ['法师'] =
        {
            {
                band = '1 - 10 等级 修炼魔法',
                list =
                {
                    {'火球术', 700},
                    {'霹雳掌', 800},
                    {'冰月神掌', 900},
                    {'风掌', 1000},
                },
            },

            {
                band = '11 - 20 等级 修炼魔法',
                list =
                {
                    {'抗拒火环', 1200},
                    {'诱惑之光', 1300},
                    {'瞬息移动', 1400},
                    {'大火球', 1500},
                    {'雷电术', 1600},
                    {'冰月震天', 1700},
                    {'击风', 1800},
                    {'地狱火', 2000},
                },
            },

            {
                band = '21 - 30 等级 修炼魔法',
                list =
                {
                    {'疾光电影', 2100},
                    {'冰沙掌', 2200},
                    {'风震天', 2300},
                    {'火墙', 2400},
                    {'圣言术', 2600},
                    {'异形换位', 2700},
                    {'魔法盾', 2900},
                },
            },

            {
                band = '31 - 40 等级 修炼魔法',
                list =
                {
                    {'爆裂火焰', 3200},
                    {'地狱雷光', 3300},
                    {'冰咆哮', 3400},
                    {'龙卷风', 3500},
                },
            },

        },
    },
}
