-- converted from Envir/Market_Def/15Magic_Mongchon3-74.txt
-- fees from Envir/QuestDiary/MU_Total_Sell

local skillteacher = require('npc.include.skillteacher')

skillteacher.setTeacher
{
    greet = '欢迎光临，贫道是道馆派来在这盟重省里开道馆的人。施主虽然不是道馆的弟子，但毕竟是修炼道学之人。世上的路有千万条，但最终都汇入大海。你在修炼中遇到困难时，贫道可以帮忙，但需要支付一些费用，武功秘籍的难易程度不同，价格也有所不同。',
    redName = '跟你这种人我无话可说。',

    books =
    {
        ['道士'] =
        {
            {
                band = '1 - 10 等级 修炼魔法',
                list =
                {
                    {'治愈术', 700},
                    {'精神力战法', 800},
                },
            },

            {
                band = '11 - 20 等级 修炼魔法',
                list =
                {
                    {'施毒术', 1200},
                    {'灵魂火符', 1300},
                    {'月魂断玉', 1400},
                    {'召唤骷髅', 1700},
                    {'隐身术', 2000},
                },
            },

            {
                band = '21 - 30 等级 修炼魔法',
                list =
                {
                    {'幽灵盾', 2100},
                    {'集体隐身术', 2300},
                    {'月魂灵波', 2400},
                    {'神圣战甲术', 2500},
                    {'困魔咒', 2700},
                    {'空拳刀法', 2800},
                    {'强魔震法', 2900},
                    {'召唤神兽', 3000},
                },
            },

            {
                band = '31 - 40 等级 修炼魔法',
                list =
                {
                    {'群体治愈术', 3100},
                    {'超强召唤骷髅', 3300},
                    {'猛虎强势', 3400},
                    {'回生术', 3500},
                },
            },

        },
    },
}
