-- converted from Envir/Market_Def/15Magic_Oasis-4.txt
-- fees from Envir/QuestDiary/MU_Total_Sell

local skillteacher = require('npc.include.skillteacher')

skillteacher.setTeacher
{
    greet = '你是从比奇省来的武士吧。最近好像从比奇来的人越来越多了。不久之前这里还没有几个从比奇来的人呢。我从那时候开始就在这儿跟战士、魔法师和道士学习武功。我还算有点实力的。呵呵，像我这种人有实力的人怎么可能练什么火球术、治愈术、基本剑术这些无足轻重的功夫呢？不是高水平的武功我都不学。<$USERNAME>你要是在修炼中遇到什么困难，我可以以我精练的武功来指导你，不过，这可不是免费的，你得交点儿学费。',
    redName = '跟你这种人我无话可说。',

    books =
    {
        ['战士'] =
        {
            {
                band = '21 - 30 等级 修炼魔法',
                list =
                {
                    {'半月弯刀', 2300},
                    {'野蛮冲撞', 2700},
                },
            },

            {
                band = '31 - 40 等级 修炼魔法',
                list =
                {
                    {'烈火剑法', 3200},
                    {'翔空剑法', 3500},
                    {'莲月剑法', 3800},
                },
            },

        },
        ['法师'] =
        {
            {
                band = '21 - 30 等级 修炼魔法',
                list =
                {
                    {'疾光电影', 2100},
                    {'冰沙掌', 2200},
                    {'风震天', 2300},
                    {'火墙', 2400},
                    {'圣言术', 2600},
                    {'异形换位', 2700},
                    {'魔法盾', 2900},
                },
            },

            {
                band = '31 - 40 等级 修炼魔法',
                list =
                {
                    {'爆裂火焰', 3200},
                    {'地狱雷光', 3300},
                    {'冰咆哮', 3400},
                    {'龙卷风', 3500},
                },
            },

        },
        ['道士'] =
        {
            {
                band = '21 - 30 等级 修炼魔法',
                list =
                {
                    {'幽灵盾', 2100},
                    {'集体隐身术', 2300},
                    {'月魂灵波', 2400},
                    {'神圣战甲术', 2500},
                    {'困魔咒', 2700},
                    {'空拳刀法', 2800},
                    {'强魔震法', 2900},
                    {'召唤神兽', 3000},
                },
            },

            {
                band = '31 - 40 等级 修炼魔法',
                list =
                {
                    {'群体治愈术', 3100},
                    {'超强召唤骷髅', 3300},
                    {'猛虎强势', 3400},
                    {'回生术', 3500},
                },
            },

        },
    },
}
