-- converted from Envir/QuestDiary/MU_wizard/fireLine.txt

local skillquest = require('quest.include.skillquest')

skillquest.setSkillQuest
{
    teacher = {'银杏山谷_02', '霹雳尊者_1'},
    job     = '法师',
    level   = 20,
    book    = '地狱火',

    fetch =
    {
        item    = '新火镜',
        monster = {'火焰沃玛'},
        kills   = 5,
        say     = '（找到了新火镜……）',
        desp    = '去取得新火镜，再回去找霹雳尊者修炼地狱火。',
    },

    lore =
    {
        '以前你分明收到了地狱火秘籍吗？你好像记错了。',
        '地狱火是一种将 像波涛一样的熊熊烈火向敌人喷射的魔法 。本魔法的要点是使在进攻者前面展开的烈火沿着一条直线蔓延开，向多数敌人发起进攻时非常有利。将敌人引诱到狭窄的地方沿一列排开，进攻效果最大。',
        '好的，凭你的实力是学习地狱火的时候了。但是要想掌握地狱火，应掌握独特的运气法。 叫 神火攻 的内功新法，按照你的能力坚持不懈练习的话，理解上不会有什么问题的。',
        '地狱火是一种将像波涛一样的熊熊烈火向敌人喷射的魔法。但是你好像还不够学习地狱火的等级。',
        '你在训练一下后，再来找我。',
        '好的，如果这样，我在了解你武功实力的同时，还可以给你一个学习地狱火的测试。',
    },

    reward = '拿到新火镜的一瞬间安全地退回这个地方就可以了。',
}
