-- converted from Envir/QuestDiary/MU_warrior/wedo.txt

local skillquest = require('quest.include.skillquest')

skillquest.setSkillQuest
{
    teacher = {'边境城市_01', '龙血先生_1'},
    job     = '战士',
    level   = 14,
    book    = '攻杀剑术',

    lore =
    {
        '你不是已经收到攻杀剑术秘籍吗？',
        '攻杀剑法可以称为放出剑气的入门武功。可以称为为了掌握上乘的武功必须经过的阶段？但是毫无疑问的是很有威力的武功。尤其是可以按照敌人的级别提高命中率和破坏力。',
        '几乎是从现在开始修炼武功的年轻人，我在你这个年纪的时候也经历了同样的问题。。',
        '按照那种理由我要帮助你的训练。虽然有些困难。。。打算怎么办？',
        '攻杀剑法可以说是习剑的入门武功，他的要领可以说是剑术的修炼。当然不是现在就要求通过消耗功力，而攻击到武器不能到达地方的上乘剑术。现在为了研习攻杀剑术只要精神集中修炼就行。即要经历剑和魂合一的阶段才行。只有通过这样的修炼，才能练成对敌的急所发出强力一击的厚实剑术。进入修炼之前，首先要装备此剑。但一旦此剑被抓在手中，直到攻杀剑术修练厚实前，不能脱手，要铭记此点。',
        '你个人认为自己的功力还很不足，但是我认为你已经充分具备了学习攻杀剑法的能力，没有必要如此谦虚。不要犹豫，请在尽早的时间里拿出勇气，挑战看看！',
    },

    reward = '为了通过测试一定要佩戴攻杀铁剑，如果丢失了，请花钱买！',
}
